Revit 2027 API
ParameterTypeId.RebarInstanceBarModelDiameter Property
 "Model Bar Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarInstanceBarModelDiameter { get; }
Public Shared ReadOnly Property RebarInstanceBarModelDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarInstanceBarModelDiameter {
	ForgeTypeId^ get ();
}
static member RebarInstanceBarModelDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace